app/controllers/users_controller.rb

    def create
        @user=User.new(user_params)
        if @user.save
            @profile = Profile.new()
            @profile[:user_id]=User.find_by(email:@user[:email])[:id]
            if @profile.save
                @education=Education.new()
                @experience=Experience.new()
                @project=Project.new()
                @education[:profile_id]=@profile[:id]
                @experience[:profile_id]=@profile[:id]
                if @experience.save && @education.save
                    @project[:experience_id]=@experience[:id]
                    @project.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at", "password_digest") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "g@gmail.com"], ["LIMIT", 1]]
INSERT INTO "profiles" ("user_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", 34], ["created_at", "2022-01-31 19:05:21.046100"], ["updated_at", "2022-01-31 19:05:21.046100"]]
INSERT INTO "educations" ("profile_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["profile_id", 8], ["created_at", "2022-02-01 10:17:52.498861"], ["updated_at", "2022-02-01 10:17:52.498861"]]
INSERT INTO "experiences" ("profile_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["profile_id", 8], ["created_at", "2022-02-01 10:17:52.401265"], ["updated_at", "2022-02-01 10:17:52.401265"]]
INSERT INTO "projects" ("experience_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["experience_id", 1], ["created_at", "2022-02-01 10:17:52.662261"], ["updated_at", "2022-02-01 10:17:52.662261"]]